package org.example;

//        Визначити специфікації класів та реалізацію методів для маніпулювання
//        зображеннями з можливістю контролювання доступу до об'єкта — доступ
//        відкритий лише до точок чиї координати (х,у) лежать в межах xl<x<x2 и
//        yl<y<y2 (значення xl,x2,yl,y2 задаються в конструкторі). Реалізувати
//        бізнес-метод для визначення кольору точки за його координатами.

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}